blog/2013-09-01-linkfest20130901.html

<!DOCTYPE HTML>
<html>
<head>
	<meta charset="utf-8">
	<title>Weekend Linkfest 1.9.2013 - Everything Counts</title>
	<meta name="author" content="Ronert Obst">

	
	<meta name="description" content="Statistics and Machine Learning 7 Important Data Science Papers New Directions in Mahout&#8217;s Recommenders DavaViz for Everyone: Responsive Maps &hellip;">
	
	<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">

	<link href="/atom.xml" rel="alternate" title="Everything Counts" type="application/atom+xml">
	<link rel="canonical" href="">
	<link href="/favicon.png" rel="shortcut icon">
	<link href="/stylesheets/screen.css" media="screen, projection" rel="stylesheet" type="text/css">
	<!--[if lt IE 9]><![endif]-->
	<!--- MathJax Configuration -->

</head>

<body>
	<header id="header" class="inner"><h1><a href="/">Everything Counts</a></h1>
<nav id="main-nav"><ul class="main">
  <li><a href="/">Blog</a></li>
  <li><a href="/blog/archives">Archives</a></li>
  <li><a href="/about/">About</a></li>
</ul>
</nav>
<nav id="mobile-nav">
	<div class="alignleft menu">
		<a class="button">Menu</a>
		<div class="container"><ul class="main">
  <li><a href="/">Blog</a></li>
  <li><a href="/blog/archives">Archives</a></li>
  <li><a href="/about/">About</a></li>
</ul>
</div>
	</div>
	<div class="alignright search">
		<a class="button"></a>
		<div class="container">
			<form action="http://google.com/search" method="get">
				<input type="text" name="q" results="0">
				<input type="hidden" name="q" value="site:ronert-obst.com">
			</form>
		</div>
	</div>
</nav>
<nav id="sub-nav" class="alignright">
	<div class="social">
		
		
		<a class="google" href="https://plus.google.com/102717496982395822694?rel=author" title="Google+">Google+</a>
		
		
		<a class="twitter" href="http://twitter.com/ronert_obst" title="Twitter">Twitter</a>
		
		
		<a class="github" href="https://github.com/ronert" title="GitHub">GitHub</a>
		
    
		
		
		
		
		
		<a class="rss" href="/atom.xml" title="RSS">RSS</a>
		
	</div>
	<form class="search" action="http://google.com/search" method="get">
		<input class="alignright" type="text" name="q" results="0">
		<input type="hidden" name="q" value="site:ronert-obst.com">
	</form>
</nav>

</header>
	
		
	
	<div id="content" class="inner"><article class="post">
	<h2 class="title">Weekend Linkfest 1.9.2013</h2>
	<div class="entry-content"><div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Statistics and Machine Learning</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><a href="http://datascience101.wordpress.com/2013/08/26/7-important-data-science-papers/">7 Important Data Science Papers</a>
</li>
<li><a href="http://de.slideshare.net/sscdotopen/new-directions-in-mahouts-recommenders">New Directions in Mahout&#8217;s Recommenders</a>
</li>
<li><a href="http://eyeseast.github.io/visible-data/2013/08/26/responsive-d3/">DavaViz for Everyone: Responsive Maps With D3</a>
</li>
<li><a href="http://andrewgelman.com/2013/08/27/bayesian-model-averaging-or-fitting-a-larger-model/">Bayesian model averaging or fitting a larger model</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">R Package of the Week</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li><a href="http://cran.r-project.org/web/packages/R2BayesX/index.html">R2BayesX</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Paper of the Week</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li><a href="http://www.nada.kth.se/utbildning/grukth/exjobb/rapportlistor/2009/rapporter09/bernhardsson_erik_09071.pdf">Implementing a Scalable Music Recommender System</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Programming</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li><a href="http://zvfak.blogspot.de/2013/08/using-javascript-visualization.html">Using JavaScript visualization libraries with R</a>
</li>
<li><a href="http://www.exegetic.biz/blog/2013/08/the-wonders-of-foreach/">The Wonders of foreach</a>
</li>
<li><a href="http://learnxinyminutes.com/">Learn X in Y Minutes: Scenic Programming Language Tours</a>
</li>
<li><a href="https://github.com/kirang89/pycrumbs/blob/master/pycrumbs.md">Nice collection of Python tutorials</a>
</li>
<li><a href="http://www.huyng.com/posts/python-performance-analysis/">A guide to analyzing Python performance « Huy Nguyen</a>
</li>
<li><a href="http://datascience101.wordpress.com/2013/08/26/7-important-data-science-papers/][7%20Important%20Data%20Science%20Papers%20|%20Data%20Science%20101]]">fasd – fast command line navigation</a>
</li>
<li><a href="https://github.com/clvv/fasd/blob/master/README.md">The Haskell Cast #1 - Edward Kmett and Lenses - YouTube</a>
</li>
<li><a href="http://eyallotem.blogspot.co.il/2013/05/comparing-python-and-haskell.html?m=1">Eyal Lotem&#8217;s thoughts: Comparing Python and Haskell</a>
</li>
<li><a href="http://blog.revolutionanalytics.com/2013/08/in-hadoop-r-based-analytics-coming-to-cloudera.html">In-Hadoop R-based Analytics coming to Cloudera</a>
</li>
<li><a href="https://github.com/docopt/docopt">docopt – Pythonic command line arguments parser, that will make you smile</a>
</li>
<li><a href="http://pystan.readthedocs.org/en/latest/">PyStan: The Python Interface to Stan</a>
</li>
</ul>
</div>
</div>
</div>


<div class="meta">
	<div class="date">








  


<time datetime="2013-09-01T00:00:00+02:00" pubdate data-updated="true">Sep 1<span>st</span>, 2013</time></div>
	<div class="tags">


	<a class='category' href='/blog/categories/linkfest/'>Linkfest</a>


</div>
	
</div></article>

	<div class="share">
	<div class="addthis_toolbox addthis_default_style ">
	
	
	<a class="addthis_button_tweet"></a>
	
	
	<a class="addthis_button_google_plusone" g:plusone:size="medium"></a>
	
	<a class="addthis_counter addthis_pill_style"></a>
	</div>
  <script type="text/javascript" src="http://s7.addthis.com/js/250/addthis_widget.js#pubid="></script>
</div>


</div>
	<footer id="footer" class="inner">Copyright &copy; 2014

    Ronert Obst

– Proud member of <a href="http://www.r-bloggers.com">www.r-bloggers.com</a>
</footer>
	<script src="/javascripts/slash.js"></script>
<script src="/javascripts/jquery.fancybox.pack.js"></script>
<script type="text/javascript">
(function($){
	$('.fancybox').fancybox();
})(jQuery);
</script> <!-- Delete or comment this line to disable Fancybox -->


<script type="text/javascript">
      var disqus_shortname = 'everythingcounts';
      
        
        var disqus_script = 'count.js';
      
    (function () {
      var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
      dsq.src = 'http://' + disqus_shortname + '.disqus.com/' + disqus_script;
      (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
    }());
</script>



	<script type="text/javascript">
		var _gaq = _gaq || [];
		_gaq.push(['_setAccount', 'UA-40781735-1']);
		_gaq.push(['_trackPageview']);

		(function() {
			var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
			ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
			var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
		})();
	</script>



</body>
</html>